RT-Thread/rt-thread/bsp/wch/arm/Libraries/CH32F20x_StdPeriph_Driver/StdPeriph_Driver/src/ch32f20x_adc.c
/********************************** (C) COPYRIGHT  *******************************
* File Name          : ch32f20x_adc.c
* Author             : WCH
* Version            : V1.0.0
* Date               : 2021/08/08
* Description        : This file provides all the ADC firmware functions. 
*******************************************************************************/ 
#include "ch32f20x_adc.h"
#include "ch32f20x_rcc.h"

/* ADC DISCNUM mask */
#define CTLR1_DISCNUM_Reset           ((uint32_t)0xFFFF1FFF)

/* ADC DISCEN mask */
#define CTLR1_DISCEN_Set              ((uint32_t)0x00000800)
#define CTLR1_DISCEN_Reset            ((uint32_t)0xFFFFF7FF)

/* ADC JAUTO mask */
#define CTLR1_JAUTO_Set               ((uint32_t)0x00000400)
#define CTLR1_JAUTO_Reset             ((uint32_t)0xFFFFFBFF)

/* ADC JDISCEN mask */
#define CTLR1_JDISCEN_Set             ((uint32_t)0x00001000)
#define CTLR1_JDISCEN_Reset           ((uint32_t)0xFFFFEFFF)

/* ADC AWDCH mask */
#define CTLR1_AWDCH_Reset             ((uint32_t)0xFFFFFFE0)

/* ADC Analog watchdog enable mode mask */
#define CTLR1_AWDMode_Reset           ((uint32_t)0xFF3FFDFF)

/* CTLR1 register Mask */
#define CTLR1_CLEAR_Mask              ((uint32_t)0xE0F0FEFF)

/* ADC ADON mask */
#define CTLR2_ADON_Set                ((uint32_t)0x00000001)
#define CTLR2_ADON_Reset              ((uint32_t)0xFFFFFFFE)

/* ADC DMA mask */
#define CTLR2_DMA_Set                 ((uint32_t)0x00000100)
#define CTLR2_DMA_Reset               ((uint32_t)0xFFFFFEFF)

/* ADC RSTCAL mask */
#define CTLR2_RSTCAL_Set              ((uint32_t)0x00000008)

/* ADC CAL mask */
#define CTLR2_CAL_Set                 ((uint32_t)0x00000004)

/* ADC SWSTART mask */
#define CTLR2_SWSTART_Set             ((uint32_t)0x00400000)

/* ADC EXTTRIG mask */
#define CTLR2_EXTTRIG_Set             ((uint32_t)0x00100000)
#define CTLR2_EXTTRIG_Reset           ((uint32_t)0xFFEFFFFF)

/* ADC Software start mask */
#define CTLR2_EXTTRIG_SWSTART_Set     ((uint32_t)0x00500000)
#define CTLR2_EXTTRIG_SWSTART_Reset   ((uint32_t)0xFFAFFFFF)

/* ADC JEXTSEL mask */
#define CTLR2_JEXTSEL_Reset           ((uint32_t)0xFFFF8FFF)

/* ADC JEXTTRIG mask */
#define CTLR2_JEXTTRIG_Set            ((uint32_t)0x00008000)
#define CTLR2_JEXTTRIG_Reset          ((uint32_t)0xFFFF7FFF)

/* ADC JSWSTART mask */
#define CTLR2_JSWSTART_Set            ((uint32_t)0x00200000)

/* ADC injected software start mask */
#define CTLR2_JEXTTRIG_JSWSTART_Set   ((uint32_t)0x00208000)
#define CTLR2_JEXTTRIG_JSWSTART_Reset ((uint32_t)0xFFDF7FFF)

/* ADC TSPD mask */
#define CTLR2_TSVREFE_Set             ((uint32_t)0x00800000)
#define CTLR2_TSVREFE_Reset           ((uint32_t)0xFF7FFFFF)

/* CTLR2 register Mask */
#define CTLR2_CLEAR_Mask              ((uint32_t)0xFFF1F7FD)

/* ADC SQx mask */
#define RSQR3_SQ_Set                  ((uint32_t)0x0000001F)
#define RSQR2_SQ_Set                  ((uint32_t)0x0000001F)
#define RSQR1_SQ_Set                  ((uint32_t)0x0000001F)

/* RSQR1 register Mask */
#define RSQR1_CLEAR_Mask              ((uint32_t)0xFF0FFFFF)

/* ADC JSQx mask */
#define ISQR_JSQ_Set                  ((uint32_t)0x0000001F)

/* ADC JL mask */
#define ISQR_JL_Set                   ((uint32_t)0x00300000)
#define ISQR_JL_Reset                 ((uint32_t)0xFFCFFFFF)

/* ADC SMPx mask */
#define SAMPTR1_SMP_Set               ((uint32_t)0x00000007)
#define SAMPTR2_SMP_Set               ((uint32_t)0x00000007)

/* ADC IDATARx registers offset */
#define IDATAR_Offset                 ((uint8_t)0x28)

/* ADC1 RDATAR register base address */
#define RDATAR_ADDRESS                ((uint32_t)0x4001244C)

/*******************************************************************************
* Function Name  : ADC_DeInit
* Description    : Deinitializes the ADCx peripheral registers to their default 
*      reset values.
* Input          : ADCx:
*                    where x can be 1 to select the ADC peripheral.
* Return         : None
*******************************************************************************/
void ADC_DeInit(ADC_TypeDef* ADCx)
{
  if (ADCx == ADC1)
  {
    RCC_APB2PeriphResetCmd(RCC_APB2Periph_ADC1, ENABLE);
    RCC_APB2PeriphResetCmd(RCC_APB2Periph_ADC1, DISABLE);
  }
  else if(ADCx == ADC2)
  {
      RCC_APB2PeriphResetCmd(RCC_APB2Periph_ADC2, ENABLE);
      RCC_APB2PeriphResetCmd(RCC_APB2Periph_ADC2, DISABLE);
  }
}

/*******************************************************************************
* Function Name  : ADC_Init
* Description    : Initializes the ADCx peripheral according to the specified 
*      parameters in the ADC_InitStruct.
* Input          : ADCx:
*                    where x can be 1 to select the ADC peripheral.
*                  ADC_InitStruct: pointer to an ADC_InitTypeDef structure that 
*      contains the configuration information for the specified ADC peripheral.
* Return         : None
*******************************************************************************/
void ADC_Init(ADC_TypeDef* ADCx, ADC_InitTypeDef* ADC_InitStruct)
{
  uint32_t tmpreg1 = 0;
  uint8_t tmpreg2 = 0;

  tmpreg1 = ADCx->CTLR1;
  tmpreg1 &= CTLR1_CLEAR_Mask;
  tmpreg1 |= (uint32_t)(ADC_InitStruct->ADC_Mode | (uint32_t) ADC_InitStruct->ADC_OutputBuffer |
          (uint32_t) ADC_InitStruct->ADC_Pga | ((uint32_t)ADC_InitStruct->ADC_ScanConvMode << 8));
  ADCx->CTLR1 = tmpreg1;

  tmpreg1 = ADCx->CTLR2;
  tmpreg1 &= CTLR2_CLEAR_Mask;
  tmpreg1 |= (uint32_t)(ADC_InitStruct->ADC_DataAlign | ADC_InitStruct->ADC_ExternalTrigConv |
            ((uint32_t)ADC_InitStruct->ADC_ContinuousConvMode << 1));
  ADCx->CTLR2 = tmpreg1;

  tmpreg1 = ADCx->RSQR1;
  tmpreg1 &= RSQR1_CLEAR_Mask;
  tmpreg2 |= (uint8_t) (ADC_InitStruct->ADC_NbrOfChannel - (uint8_t)1);
  tmpreg1 |= (uint32_t)tmpreg2 << 20;
  ADCx->RSQR1 = tmpreg1;
}

/*******************************************************************************
* Function Name  : ADC_StructInit
* Description    : Fills each ADC_InitStruct member with its default value.
* Input          : ADC_InitStruct : pointer to an ADC_InitTypeDef structure that
*      contains the configuration information for the specified ADC peripheral.
* Return         : None
*******************************************************************************/
void ADC_StructInit(ADC_InitTypeDef* ADC_InitStruct)
{
  ADC_InitStruct->ADC_Mode = ADC_Mode_Independent;
  ADC_InitStruct->ADC_ScanConvMode = DISABLE;
  ADC_InitStruct->ADC_ContinuousConvMode = DISABLE;
  ADC_InitStruct->ADC_ExternalTrigConv = ADC_ExternalTrigConv_T1_CC1;
  ADC_InitStruct->ADC_DataAlign = ADC_DataAlign_Right;
  ADC_InitStruct->ADC_NbrOfChannel = 1;
}

