RT-Thread/rt-thread/bsp/wch/arm/Libraries/CH32F20x_StdPeriph_Driver/StdPeriph_Driver/src/ch32f20x_adc.c
/*******************************************************************************
* Function Name  : ADC_AutoInjectedConvCmd
* Description    : Enables or disables the selected ADC automatic injected group
*      conversion after regular one.
* Input          : ADCx:
*                    where x can be 1 to select the ADC peripheral.
*                  NewState: ENABLE or DISABLE.
* Return         : None
*******************************************************************************/
void ADC_AutoInjectedConvCmd(ADC_TypeDef* ADCx, FunctionalState NewState)
{
  if (NewState != DISABLE)
  {
    ADCx->CTLR1 |= CTLR1_JAUTO_Set;
  }
  else
  {
    ADCx->CTLR1 &= CTLR1_JAUTO_Reset;
  }
}

/*******************************************************************************
* Function Name  : ADC_InjectedDiscModeCmd
* Description    : Enables or disables the discontinuous mode for injected group
*      channel for the specified ADC.
* Input          : ADCx:
*                    where x can be 1 to select the ADC peripheral.
*                  NewState: ENABLE or DISABLE.
* Return         : None
*******************************************************************************/
void ADC_InjectedDiscModeCmd(ADC_TypeDef* ADCx, FunctionalState NewState)
{
  if (NewState != DISABLE)
  {
    ADCx->CTLR1 |= CTLR1_JDISCEN_Set;
  }
  else
  {
    ADCx->CTLR1 &= CTLR1_JDISCEN_Reset;
  }
}

/*******************************************************************************
* Function Name  : ADC_ExternalTrigInjectedConvConfig
* Description    : Configures the ADCx external trigger for injected channels conversion.
* Input          : ADCx:
*                    where x can be 1 to select the ADC peripheral.
*                  ADC_ExternalTrigInjecConv: specifies the ADC trigger to start 
*      injected conversion.
*                    ADC_ExternalTrigInjecConv_T1_TRGO: Timer1 TRGO event selected.
*                    ADC_ExternalTrigInjecConv_T1_CC4: Timer1 capture compare4 selected. 
*                    ADC_ExternalTrigInjecConv_T2_TRGO: Timer2 TRGO event selected. 
*                    ADC_ExternalTrigInjecConv_T2_CC1: Timer2 capture compare1 selected. 
*                    ADC_ExternalTrigInjecConv_T3_CC4: Timer3 capture compare4 selected. 
*                    ADC_ExternalTrigInjecConv_T4_TRGO: Timer4 TRGO event selected.
*                    ADC_ExternalTrigInjecConv_Ext_IT15_TIM8_CC4: External interrupt 
*      line 15 event selected.
*                    ADC_ExternalTrigInjecConv_None: Injected conversion started
*      by software and not by external trigger.                   
* Return         : None
*******************************************************************************/
void ADC_ExternalTrigInjectedConvConfig(ADC_TypeDef* ADCx, uint32_t ADC_ExternalTrigInjecConv)
{
  uint32_t tmpreg = 0;

  tmpreg = ADCx->CTLR2;
  tmpreg &= CTLR2_JEXTSEL_Reset;
  tmpreg |= ADC_ExternalTrigInjecConv;
  ADCx->CTLR2 = tmpreg;
}

/*******************************************************************************
* Function Name  : ADC_ExternalTrigInjectedConvCmd
* Description    : Enables or disables the ADCx injected channels conversion through
*      external trigger.
* Input          : ADCx:
*                    where x can be 1 to select the ADC peripheral.
*                  NewState: ENABLE or DISABLE.
* Return         : None
*******************************************************************************/
void ADC_ExternalTrigInjectedConvCmd(ADC_TypeDef* ADCx, FunctionalState NewState)
{
  if (NewState != DISABLE)
  {
    ADCx->CTLR2 |= CTLR2_JEXTTRIG_Set;
  }
  else
  {
    ADCx->CTLR2 &= CTLR2_JEXTTRIG_Reset;
  }
}

/*******************************************************************************
* Function Name  : ADC_SoftwareStartInjectedConvCmd
* Description    : Enables or disables the selected ADC start of the injected 
*      channels conversion.
* Input          : ADCx:
*                    where x can be 1 to select the ADC peripheral.
*                  NewState: ENABLE or DISABLE.
* Return         : None
*******************************************************************************/
void ADC_SoftwareStartInjectedConvCmd(ADC_TypeDef* ADCx, FunctionalState NewState)
{
  if (NewState != DISABLE)
  {
    ADCx->CTLR2 |= CTLR2_JEXTTRIG_JSWSTART_Set;
  }
  else
  {
    ADCx->CTLR2 &= CTLR2_JEXTTRIG_JSWSTART_Reset;
  }
}

/*******************************************************************************
* Function Name  : ADC_GetSoftwareStartInjectedConvCmdStatus
* Description    : Gets the selected ADC Software start injected conversion Status.
* Input          : ADCx:
*                    where x can be 1 to select the ADC peripheral.
* Return         : FlagStatus: SET or RESET.
*******************************************************************************/
FlagStatus ADC_GetSoftwareStartInjectedConvCmdStatus(ADC_TypeDef* ADCx)
{
  FlagStatus bitstatus = RESET;
	
  if ((ADCx->CTLR2 & CTLR2_JSWSTART_Set) != (uint32_t)RESET)
  {
    bitstatus = SET;
  }
  else
  {
    bitstatus = RESET;
  }

  return  bitstatus;
}

/*******************************************************************************
* Function Name  : ADC_InjectedChannelConfig
* Description    : Configures for the selected ADC injected channel its corresponding
*      rank in the sequencer and its sample time.
* Input          : ADCx:
*                    where x can be 1 to select the ADC peripheral.
*                  ADC_Channel: the ADC channel to configure.
*                    ADC_Channel_0: ADC Channel0 selected.
*                    ADC_Channel_1: ADC Channel1 selected.
*                    ADC_Channel_2: ADC Channel2 selected.
*                    ADC_Channel_3: ADC Channel3 selected.
*                    ADC_Channel_4: ADC Channel4 selected.
*                    ADC_Channel_5: ADC Channel5 selected.
*                    ADC_Channel_6: ADC Channel6 selected.
*                    ADC_Channel_7: ADC Channel7 selected.
*                    ADC_Channel_8: ADC Channel8 selected.
*                    ADC_Channel_9: ADC Channel9 selected.
*                    ADC_Channel_10: ADC Channel10 selected.
*                    ADC_Channel_11: ADC Channel11 selected.
*                    ADC_Channel_12: ADC Channel12 selected.
*                    ADC_Channel_13: ADC Channel13 selected.
*                    ADC_Channel_14: ADC Channel14 selected.
*                    ADC_Channel_15: ADC Channel15 selected.
*                    ADC_Channel_16: ADC Channel16 selected.
*                    ADC_Channel_17: ADC Channel17 selected.
*                  Rank: The rank in the injected group sequencer.
*                    This parameter must be between 1 to 4.
*                  ADC_SampleTime: The sample time value to be set for the selected channel.
*                    ADC_SampleTime_1Cycles5: Sample time equal to 1.5 cycles.
*                    ADC_SampleTime_7Cycles5: Sample time equal to 7.5 cycles.
*                    ADC_SampleTime_13Cycles5: Sample time equal to 13.5 cycles.
*                    ADC_SampleTime_28Cycles5: Sample time equal to 28.5 cycles.	
*                    ADC_SampleTime_41Cycles5: Sample time equal to 41.5 cycles.	
*                    ADC_SampleTime_55Cycles5: Sample time equal to 55.5 cycles.	
*                    ADC_SampleTime_71Cycles5: Sample time equal to 71.5 cycles.	
*                    ADC_SampleTime_239Cycles5: Sample time equal to 239.5 cycles.                   
* Return         : None
*******************************************************************************/
void ADC_InjectedChannelConfig(ADC_TypeDef* ADCx, uint8_t ADC_Channel, uint8_t Rank, uint8_t ADC_SampleTime)
{
  uint32_t tmpreg1 = 0, tmpreg2 = 0, tmpreg3 = 0;

  if (ADC_Channel > ADC_Channel_9)
  {
    tmpreg1 = ADCx->SAMPTR1;
    tmpreg2 = SAMPTR1_SMP_Set << (3*(ADC_Channel - 10));
    tmpreg1 &= ~tmpreg2;
    tmpreg2 = (uint32_t)ADC_SampleTime << (3*(ADC_Channel - 10));
    tmpreg1 |= tmpreg2;
    ADCx->SAMPTR1 = tmpreg1;
  }
  else 
  {
    tmpreg1 = ADCx->SAMPTR2;
    tmpreg2 = SAMPTR2_SMP_Set << (3 * ADC_Channel);
    tmpreg1 &= ~tmpreg2;
    tmpreg2 = (uint32_t)ADC_SampleTime << (3 * ADC_Channel);
    tmpreg1 |= tmpreg2;
    ADCx->SAMPTR2 = tmpreg1;
  }

  tmpreg1 = ADCx->ISQR;
  tmpreg3 =  (tmpreg1 & ISQR_JL_Set)>> 20;
  tmpreg2 = ISQR_JSQ_Set << (5 * (uint8_t)((Rank + 3) - (tmpreg3 + 1)));
  tmpreg1 &= ~tmpreg2;
  tmpreg2 = (uint32_t)ADC_Channel << (5 * (uint8_t)((Rank + 3) - (tmpreg3 + 1)));
  tmpreg1 |= tmpreg2;
  ADCx->ISQR = tmpreg1;
}

