RT-Thread/rt-thread/bsp/wch/arm/Libraries/CH32F20x_StdPeriph_Driver/StdPeriph_Driver/src/ch32f20x_adc.c
/*******************************************************************************
* Function Name  : ADC_InjectedSequencerLengthConfig
* Description    : Configures the sequencer length for injected channels.
* Input          : ADCx:
*                    where x can be 1 to select the ADC peripheral.
*                  Length: The sequencer length.
*                    This parameter must be a number between 1 to 4.
* Return         : None
*******************************************************************************/
void ADC_InjectedSequencerLengthConfig(ADC_TypeDef* ADCx, uint8_t Length)
{
  uint32_t tmpreg1 = 0;
  uint32_t tmpreg2 = 0;

  tmpreg1 = ADCx->ISQR;
  tmpreg1 &= ISQR_JL_Reset;
  tmpreg2 = Length - 1; 
  tmpreg1 |= tmpreg2 << 20;
  ADCx->ISQR = tmpreg1;
}

/*******************************************************************************
* Function Name  : ADC_SetInjectedOffset
* Description    : Set the injected channels conversion value offset.
* Input          : ADCx:
*                    where x can be 1 to select the ADC peripheral.
*                  ADC_InjectedChannel: the ADC injected channel to set its offset. 
*                    ADC_InjectedChannel_1: Injected Channel1 selected.
*                    ADC_InjectedChannel_2: Injected Channel2 selected.
*                    ADC_InjectedChannel_3: Injected Channel3 selected.
*                    ADC_InjectedChannel_4: Injected Channel4 selected.
*                  Offset: the offset value for the selected ADC injected channel.
*                    This parameter must be a 12bit value.
* Return         : None
*******************************************************************************/
void ADC_SetInjectedOffset(ADC_TypeDef* ADCx, uint8_t ADC_InjectedChannel, uint16_t Offset)
{
  __IO uint32_t tmp = 0;
  
  tmp = (uint32_t)ADCx;
  tmp += ADC_InjectedChannel;
  
  *(__IO uint32_t *) tmp = (uint32_t)Offset;
}

/*******************************************************************************
* Function Name  : ADC_GetInjectedConversionValue
* Description    : Returns the ADC injected channel conversion result.
* Input          : ADCx:
*                    where x can be 1 to select the ADC peripheral.
*                  ADC_InjectedChannel: the converted ADC injected channel.
*                    ADC_InjectedChannel_1: Injected Channel1 selected.
*                    ADC_InjectedChannel_2: Injected Channel2 selected.
*                    ADC_InjectedChannel_3: Injected Channel3 selected.
*                    ADC_InjectedChannel_4: Injected Channel4 selected.
* Return         : tmp: The Data conversion value.
*******************************************************************************/
uint16_t ADC_GetInjectedConversionValue(ADC_TypeDef* ADCx, uint8_t ADC_InjectedChannel)
{
  __IO uint32_t tmp = 0;
  
  tmp = (uint32_t)ADCx;
  tmp += ADC_InjectedChannel + IDATAR_Offset;
  
  return (uint16_t) (*(__IO uint32_t*)  tmp);   
}

/*******************************************************************************
* Function Name  : ADC_AnalogWatchdogCmd
* Description    : Enables or disables the analog watchdog on single/all regular
*      or injected channels.
* Input          : ADCx:
*                    where x can be 1 to select the ADC peripheral.
*                  ADC_AnalogWatchdog: the ADC analog watchdog configuration.
*                    ADC_AnalogWatchdog_SingleRegEnable: Analog watchdog on a 
*      single regular channel.
*                    ADC_AnalogWatchdog_SingleInjecEnable: Analog watchdog on a 
*      single injected channel.
*                    ADC_AnalogWatchdog_SingleRegOrInjecEnable: Analog watchdog 
*      on a single regular or injected channel.
*                    ADC_AnalogWatchdog_AllRegEnable: Analog watchdog on  all 
*      regular channel.
*                    ADC_AnalogWatchdog_AllInjecEnable: Analog watchdog on  all 
*      injected channel.
*                    ADC_AnalogWatchdog_AllRegAllInjecEnable: Analog watchdog on 
*      all regular and injected channels.
*                    ADC_AnalogWatchdog_None: No channel guarded by the analog 
*      watchdog.
* Return         : None
*******************************************************************************/
void ADC_AnalogWatchdogCmd(ADC_TypeDef* ADCx, uint32_t ADC_AnalogWatchdog)
{
  uint32_t tmpreg = 0;

  tmpreg = ADCx->CTLR1;
  tmpreg &= CTLR1_AWDMode_Reset;
  tmpreg |= ADC_AnalogWatchdog;
  ADCx->CTLR1 = tmpreg;
}

/*******************************************************************************
* Function Name  : ADC_AnalogWatchdogThresholdsConfig
* Description    : Configures the high and low thresholds of the analog watchdog.
* Input          : ADCx:
*                    where x can be 1 to select the ADC peripheral.
*                  HighThreshold: the ADC analog watchdog High threshold value.
*                    This parameter must be a 12bit value.
*                  LowThreshold: the ADC analog watchdog Low threshold value.
*                    This parameter must be a 12bit value.
* Return         : None
*******************************************************************************/
void ADC_AnalogWatchdogThresholdsConfig(ADC_TypeDef* ADCx, uint16_t HighThreshold,
                                        uint16_t LowThreshold)
{
  ADCx->WDHTR = HighThreshold;
  ADCx->WDLTR = LowThreshold;
}

/*******************************************************************************
* Function Name  : ADC_AnalogWatchdogSingleChannelConfig
* Description    : Configures the analog watchdog guarded single channel.
* Input          : ADCx:
*                    where x can be 1 to select the ADC peripheral.
*                  ADC_Channel: the ADC channel to configure for the analog watchdog.
*                    ADC_Channel_0: ADC Channel0 selected.
*                    ADC_Channel_1: ADC Channel1 selected.
*                    ADC_Channel_2: ADC Channel2 selected.
*                    ADC_Channel_3: ADC Channel3 selected.
*                    ADC_Channel_4: ADC Channel4 selected.
*                    ADC_Channel_5: ADC Channel5 selected.
*                    ADC_Channel_6: ADC Channel6 selected.
*                    ADC_Channel_7: ADC Channel7 selected.
*                    ADC_Channel_8: ADC Channel8 selected.
*                    ADC_Channel_9: ADC Channel9 selected.
*                    ADC_Channel_10: ADC Channel10 selected.
*                    ADC_Channel_11: ADC Channel11 selected.
*                    ADC_Channel_12: ADC Channel12 selected.
*                    ADC_Channel_13: ADC Channel13 selected.
*                    ADC_Channel_14: ADC Channel14 selected.
*                    ADC_Channel_15: ADC Channel15 selected.
*                    ADC_Channel_16: ADC Channel16 selected.
*                    ADC_Channel_17: ADC Channel17 selected.                   
* Return         : None
*******************************************************************************/
void ADC_AnalogWatchdogSingleChannelConfig(ADC_TypeDef* ADCx, uint8_t ADC_Channel)
{
  uint32_t tmpreg = 0;

